import editor.Editor;

/**
 * Команда — это поведенческий паттерн, позволяющий заворачивать запросы или простые операции в отдельные объекты.
 * Это позволяет откладывать выполнение команд, выстраивать их в очереди, а также хранить историю и делать отмену.
 *
 * Применимость: Паттерн можно часто встретить в Java-коде, особенно когда нужно откладывать выполнение команд,
 * выстраивать их в очереди, а также хранить историю и делать отмену.
 *
 * Признаки применения паттерна: Классы команд построены вокруг одного действия и имеют очень узкий контекст.
 * Объекты команд часто подаются в обработчики событий элементов GUI.
 * Практически любая реализация отмены использует принципа команд.
 *
 * Пример: Команды текстового редактора и их отмена
 * По реакции на действия пользователя, текстовый редактор создаёт объекты команд.
 * Каждая команда выполняет некоторое действие, а затем попадают в стек истории.
 * Теперь, чтобы выполнить отмену, мы берём последнюю команду из списка
 * и выполняем обратное действие либо восстанавливаем состояние редактора, сохранённое в этой команде.
 */
public class Main {
    public static void main(String[] args) {
        Editor editor = new Editor();
        editor.init();
    }
}
